# RbsSizeLock Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsSizeLock Property
ParameterTypeId Class See Also
---
"Size Lock"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsSizeLock { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsSizeLock As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsSizeLock {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace